# Рост взрослого населения города X имеет нормальное распределение, причем, средний рост равен 174 см, 
# а среднее квадратическое отклонение равно 8 см. посчитайте, какова вероятность того, 
# что случайным образом выбранный взрослый человек имеет рост:
# 1. больше 182 см? 2. больше 190 см? 3. от 166 см до 190 см? 4. от 166 см до 182 см? 5. от 158 см до 190 см?
# 6. не выше 150 см или не ниже 190 см? 7. не выше 150 см или не ниже 198 см? 8. ниже 166 см?
# Задачу можно решить двумя способами: 
# без использования сторонних библиотек (numpy, scipy, pandas и пр.), 
# а затем проверить себя с помощью встроенных функций

import math
import scipy.stats as stat

def normal (x, m, s):
    result_z = (x - m) / s
    return result_z

print('\nРост взрослого населения города X имеет нормальное распределение, причем, средний рост равен 174 см, \n\
а среднее квадратическое отклонение равно 8 см. посчитайте, какова вероятность того, \n\
что случайным образом выбранный взрослый человек имеет рост:\n')

M = 174
s = 8

x = 182
z = normal(x, M, s)
table_z = 0.84134
result_1 = stat.norm.cdf(x, loc = M, scale = s)
print(f'1. больше 182 см?\n\
P(x > {x}) = 1 - P(x < {x}) = 1 - F({x}) = 1 - Fz({z}) = 1 - {table_z} = {1 - table_z}.\n\
Вариант решения через правило 3х сигм: 50% - 68% / 2 = 16%.\n\
Проверка автоматического решения: {1 - result_1}.\n')

x = 190
z = normal(x, M, s)
table_z = 0.97725
result_2 = stat.norm.cdf(x, loc = M, scale = s)
print(f'2. больше 190 см?\n\
P(x > {x}) = 1 - P(x < {x}) = 1 - F({x}) = 1 - Fz({z}) = 1 - {table_z} = {1 - table_z}.\n\
Вариант решения через правило 3х сигм: 50% - 95,4% / 2 = 2,3%.\n\
Проверка автоматического решения: {1 - result_2}.\n')

x1 = 166
x2 = 190
z = normal(x1, M, s)
table_z1 = 0.15866
table_z2 = 0.97725
result_3 = result_2 - stat.norm.cdf(x1, loc = M, scale = s)
print(f'3. от 166 см до 190 см?\n\
P({x1} < x < {x2}) = P(x < {x2}) - P(x < {x1}) = F({x2}) - F({x1}) = {table_z2} - {table_z1} = {table_z2 - table_z1}.\n\
Вариант решения через правило 3х сигм: {result_2} - (50% - 68% / 2) = {result_2 - (0.5 - 0.68/2)}.\n\
Проверка автоматического решения: {result_3}.\n')

x1 = 166
x2 = 182
z = normal(x1, M, s)
table_z1 = 0.15866
table_z2 = 0.84134
result_4 = result_1 - stat.norm.cdf(x1, loc = M, scale = s)
print(f'4. от 166 см до 182 см?\n\
P({x1} < x < {x2}) = P(x < {x2}) - P(x < {x1}) = F({x2}) - F({x1}) = {table_z2} - {table_z1} = {table_z2 - table_z1}.\n\
Вариант решения через правило 3х сигм: {result_1} - (50% - 68% / 2) = {result_1 - (0.5 - 0.68/2)}.\n\
Проверка автоматического решения: {result_4}.\n')

x1 = 158
x2 = 190
z = normal(x1, M, s)
table_z1 = 0.02275
table_z2 = 0.97725
result_5 = result_2 - stat.norm.cdf(x1, loc = M, scale = s)
print(f'5. от 158 см до 190 см?\n\
P({x1} < x < {x2}) = P(x < {x2}) - P(x < {x1}) = F({x2}) - F({x1}) = {table_z2} - {table_z1} = {table_z2 - table_z1}.\n\
Вариант решения через правило 3х сигм: {result_2} - (50% - 95,4% / 2) = {result_2 - (0.5 - 0.954/2)}.\n\
Проверка автоматического решения: {result_5}.\n')

x1 = 150
x2 = 190
z = normal(x1, M, s)
table_z1 = 0.00135
table_z2 = 0.97725
result_6 = 1 - result_2 + stat.norm.cdf(x1, loc = M, scale = s)
print(f'6. не выше 150 см или не ниже 190 см?\n\
P(x < {x1}) + P(x > {x2}) = P(x < {x1}) + (1 - P(x < {x2}))  = F({x1}) + (1 - F({x2})) = {table_z1} + (1 - {table_z2}) = {table_z1 + 1 - table_z2}.\n\
Вариант решения через правило 3х сигм: (50% - 99,72% / 2) + (50% - 95,4% / 2) = {(0.5 - 0.9972/2) + (0.5 - 0.954/2)}.\n\
Проверка автоматического решения: {result_6}.\n')

x1 = 150
x2 = 198
z = normal(x2, M, s)
table_z1 = 0.00135
table_z2 = 0.99865
result_7 = stat.norm.cdf(x1, loc = M, scale = s) + (1 - stat.norm.cdf(x2, loc = M, scale = s))
print(f'7. не выше 150 см или не ниже 198 см?\n\
P(x < {x1}) + P(x > {x2}) = P(x < {x1}) + (1 - P(x < {x2}))  = F({x1}) + (1 - F({x2})) = {table_z1} + (1 - {table_z2}) = {table_z1 + 1 - table_z2}.\n\
Вариант решения через правило 3х сигм: M = 174. 174 + 8*3 = 198, 174 - 8*3 = 150. \n\
Согласно правилу в промежутке +/- 3 сигмы лежит 99,72% значений  => вне промежутка 1 - 0,9972 = {1 - 0.9972}.\n\
Проверка автоматического решения: {result_7}.\n')

x = 166
z = normal(x2, M, s)
table_z = 0.15866
result_8 = stat.norm.cdf(x, loc = M, scale = s)
print(f'8. ниже 166 см?\n\
P(x < {x}) = F({x}) = Fz({z}) = {table_z}.\n\
Вариант решения через правило 3х сигм: M = 174. 174 - 8 = 166.\n\
Согласно правилу в промежутке +/- 1 сигмы лежит 68% значений  => вне промежутка 50% - 68% / 2 = {0.5 - 0.68 / 2}.\n\
Проверка автоматического решения: {result_8}.\n')